///-------------------------------------------------------------------
//*
//*	@名前		ScrapA.cpp
//*
//*	@作成日		2017/05/08
//*
//*	@著者		加藤 彰馬
//*
///-------------------------------------------------------------------

// ヘッダーファイルのインクルード
#include "Scraps\BaseScrap.h"
#include "Scraps\ScrapA.h"

// cocos2d-xの名前空間
USING_NS_CC;


////////////////////////////
/// プレイヤクラスの定義 ///
////////////////////////////

////----------------------------------------------------------------------
////! @関数名：init
////!
////! @役割：プレイヤクラスの初期化処理
////!
////! @引数：なし
////!
////! @戻り値：初期化に成功したか否か(bool)
////----------------------------------------------------------------------
bool ScrapA::init()
{
	// 毎フレーム更新を有効化
	scheduleUpdate();


	//==========スクラップの設置・表示==========//
	// スクラップスプライトの作成
	scrapA = Sprite::create("scrapA.png");
	this->addChild(scrapA);


	// 初期化が正常に終了
	return true;
}


////----------------------------------------------------------------------
////! @関数名：update
////!
////! @役割：プレイやクラスの毎フレーム処理
////!
////! @引数：フレーム数(float)
////!
////! @戻り値：なし
////----------------------------------------------------------------------
void ScrapA::update(float delta)
{

}


////----------------------------------------------------------------------
////! @関数名：SetScrap_pos
////!
////! @役割：スクラップの初期位置を決める
////!
////! @引数：x座標(float)とy座標(float)
////!
////! @戻り値：スクラップの位置(Vec2)
////----------------------------------------------------------------------
void ScrapA::SetScrap_pos(float x, float y)
{
	//scrap_pos = (x, y);
}

